package DTree.java;

import java.util.Map;

/**
 *********************************************************
 ** @desc  ： 数据集
 ** @author  Pings
 ** @date    2017/12/8
 ** @version v1.0
 * *******************************************************
 */
public interface DataList {

    /**
     *********************************************************
     ** @desc ：保存一条训练数据
     ** @author Pings
     ** @date   2017/12/06
     ** @param  row 训练数据
     ** *******************************************************
     */
    void putTrain(String[] row);

    /**
     *********************************************************
     ** @desc ：保存一条训练数据
     ** @author Pings
     ** @date   2017/12/06
     ** @param  row 训练数据
     ** *******************************************************
     */
    void putTrain(Row row);

    /**
     *********************************************************
     ** @desc ：设置一条测试数据
     ** @author Pings
     ** @date   2017/12/06
     ** @param  row 测试数据
     ** *******************************************************
     */
    void setTest(String[] row);

    /**
     *********************************************************
     ** @desc ：设置属性描述
     ** @author Pings
     ** @date   2017/12/07
     ** @param  row 训练数据
     ** *******************************************************
     */
    void setDesc(String[] row);

    /**
     *********************************************************
     ** @desc ：获取列的描述信息
     ** @author Pings
     ** @date   2017/12/07
     ** @return 列的描述信息
     ** *******************************************************
     */
    Desc getDesc();

    /**
     *********************************************************
     ** @desc ：获取测试数据
     ** @author Pings
     ** @date   2017/12/07
     ** @return 测试数据
     ** *******************************************************
     */
    Row getTest();

    /**
     *********************************************************
     ** @desc ：获取指定分类的所有训练数据
     ** @author Pings
     ** @date   2017/11/16
     ** @param  c 分类
     ** @return 分类为c的所有训练数据
     ** *******************************************************
     */
    Row[] getTrains(String c);

    /**
     *********************************************************
     ** @desc ：获取所有的分类
     ** @author Pings
     ** @date   2017/11/16
     ** @return  所有的结果类型
     ** *******************************************************
     */
    String[] getAllC();

    /**
     *********************************************************
     ** @desc ：获取数据集行的数量
     ** @author Pings
     ** @date   2017/12/07
     ** @return 列的总数量
     ** *******************************************************
     */
    long getRowQty();

    /**
     *********************************************************
     ** @desc ：获取数据集列的总数量，不包含分类列
     ** @author Pings
     ** @date   2017/12/07
     ** @return 列的总数量
     ** *******************************************************
     */
    int getColumnQty();

    /**
     *********************************************************
     ** @desc ：获取指定列不重复的值
     ** @author Pings
     ** @date   2017/12/07
     ** @param  column 列的顺序
     ** @return 列不重复的值
     ** *******************************************************
     */
    String[] getUniqueColumn(int column);

    /**
     *********************************************************
     ** @desc ：获取指定列的值
     ** @author Pings
     ** @date   2017/12/07
     ** @param  column 列的顺序
     ** @return 列值
     ** *******************************************************
     */
    String[] getColumn(int column);

    /**
     *********************************************************
     ** @desc ：获取指定列和列值的数量
     ** @author Pings
     ** @date   2017/12/07
     ** @param  column 列的顺序
     ** @param  columnValue 列的值
     ** @return 数量
     ** *******************************************************
     */
    long getColumnQty(int column, String columnValue);

    /**
     *********************************************************
     ** @desc ：获取指定列、列值和分类的数量
     ** @author Pings
     ** @date   2017/12/07
     ** @param  column 列的顺序
     ** @param  columnValue 列的值
     ** @param  c      分类
     ** @return 数量
     ** *******************************************************
     */
    long getColumnQty(int column , String columnValue, String c);

    /**
     *********************************************************
     ** @desc ：获取指定列每种列值的数量
     ** @author Pings
     ** @date   2017/12/07
     ** @param  column 列的顺序
     ** @return 每种列值的数量
     ** *******************************************************
     */
    Map<String, Long> getColumnAllQty(int column);

    /**
     *********************************************************
     ** @desc ：获取指定列和分类的每种列值的数量
     ** @author Pings
     ** @date   2017/12/07
     ** @param  column 列的顺序
     ** @param  c      分类
     ** @return 每种列值的数量
     ** *******************************************************
     */
    Map<String, Long> getColumnAllQty(int column , String c);

    /**
     *********************************************************
     ** @desc ：获取指定分类的数量
     ** @author Pings
     ** @date   2017/12/07
     ** @param  c      分类
     ** @return 数量
     ** *******************************************************
     */
    long getColumnQty(String c);

    /**
     *********************************************************
     ** @desc ：获取每种分类的数量
     ** @author Pings
     ** @date   2017/12/07
     ** @return 每种分类的数量
     ** *******************************************************
     */
    Map<String, Long> getColumnAllQty();
}
